{
  "title": "3D Printed Brick",
  "creators": ["Aarush Maddula"],
  "date": "October 4, 2024",
  "description": "I designed and modeled a 2x4 Lego Brick using the Autodesk Fusion 360 software and 3D printing it using Afinia Studio and an Afinia H400+ 3D printer as part of a design project in my Engineering Class.",
  "thumbnail": "/projects/3d-printed-brick/images/brick.jpeg",
  "type": "engineering",
  "tags": ["Fusion 360", "3D Printing"],
  "timeline": [
    {
      "heading": "Designing the Brick",
      "description": "I launched the Fusion 360 app, created a file, and started designing my Lego brick. With the help of a tutorial, I quickly learned the basics of Fusion.\n\n I first created a box by making a rectangular sketch and extruding it to the appropriate height. I created the studs by creating a circular sketch and distanced it from the edge using the sketch dimension tool. I then extruded it to the proper stud height and created another sketch on top with 'Lego' written, which I then extruded. I selected the stud and used the Rectangular pattern action to create an array of the studs. To hollow out the bottom, I used the shell action, which completed the tutorial's version of the Lego Brick.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/block.png",
          "caption": "Creating a Box"
        },
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/stud.png",
          "caption": "Creating a Stud"
        },
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/studs.png",
          "caption": "Adding more Studs"
        },
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/bottom.png",
          "caption": "Hollowing the bottom"
        }
      ]
    }, 
    {
      "heading": "Adding Anti-studs",
      "description": "I thought I could try using my new skills to design the underside of the Lego Brick so I could connect it properly with my other Lego Bricks at home. I started by looking up the dimensions of a Lego brick online and using that information to model. I created a few sketches, aligning them using the sketch dimensions feature, and extruding them to make the anti-studs and the notches along the edge. I eventually ended up with the design on the right.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/diagram.png",
          "caption": "Lego Brick Diagram"
        },
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/antistuds.png",
          "caption": "Lego Brick Anti-studs"
        }
      ]
    }, 
    {
      "heading": "Printing the Brick",
      "description": "I first set up the 3D Printer by calibrating the filament nozzle and loading the blue PLA filament roll into it. I then loaded my stl file into Afinia Studio and sent a request to the printer to start printing. After 25 minutes, the printer finished printing the brick.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/print.jpeg",
          "caption": "Brick in 3D Printer"
        }
      ]
    }, 
    {
      "heading": "Final Results & Thoughts",
      "description": "After removing the support filament, I ended up with the 3D-printed brick on the right. Overall, I thought this experience was very fun as I got to learn a lot about 3D modeling and printing. I gained a lot of skills throughout this project, like using the basic functions of Fusion 360, using Afinia Studio to load the project file, and setting up the 3D printer to print the Lego Brick. I could use these skills in the future if I needed to 3D print an outer case for any electrical projects I might have so it looks more appealing. I realized I could make some improvements to my brick, such as smoothening out the sides by using sandpaper to sand out the sides. The Lego text I added to the top didn't show on the final design, so I could've selected the more detailed print option so that it would've appeared.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/brick.jpeg",
          "caption": "3D-Printed Lego Brick"
        },
        {
          "type": "image",
          "path": "/projects/3d-printed-brick/images/brickbottom.jpeg",
          "caption": "Bottom of the Brick"
        }
      ]
    }
  ],
  "resources": [
    {
      "name": "Tutorial: How to 3D Model a Lego Brick in Fusion 360",
      "icon": "/icons/youtube.svg",
      "path": "https://www.youtube.com/watch?v=H9ShjT8wer4"
    },
    {
      "name": "Lego Brick STL File",
      "icon": "/icons/file.svg",
      "path": "/projects/3d-printed-brick/resources/Lego Brick.stl"
    }
  ]
}