{
  "title": "Lego Line Follower",
  "creators": ["Aarush Maddula", "Kevin Zarate Nonato", "Angel Edgardo Aguilar Gonzalez"],
  "date": "October 17, 2024",
  "description": "Our group built a Lego line-follower Robot designed to navigate a course without going off the edge, placing 1st place for the fastest robot in a class competition.",
  "thumbnail": "/projects/lego-line-follower/images/robot.jpeg",
  "type": "engineering",
  "tags": ["Code", "Collaboration", "Lego"],
  "timeline": [
    {
      "heading": "Brainstorming",
      "description": "We worked together to come up with a small, lightweight, maneuverable design to reliably navigate through the course. We planned to put 2 wheels in the back with a rolling ball in the front to make turning easy with the color sensor was in front since we wanted to detect the tape ahead of time so the robot could turn before it went past the tape.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-line-follower/images/sketch.jpeg",
          "caption": "Final Sketch"
        }
      ]
    }, 
    {
      "heading": "Initial Build",
      "description": "We built the car as outlined in our brainstorming session. Our table had blue tape in the shape of a rectangle, which allowed us to quickly test and modify our robot. We tested the design on our table to make sure our concept and code worked, which it did.",
      "resources": [
        {
          "type": "image",
          "path":  "/projects/lego-line-follower/images/prototype.jpeg",
          "caption": "Initial Build"
        },
        {
          "type": "video",
          "id":  "1PMtKXvLAkDuMOFV9BIWPk3W0b7GL5M6Z",
          "caption": "Testing the code"
        }
      ]
    }, 
    {
      "heading": "Programming",
      "description": "We thought making the robot go along the blue edge would be simpler, so Version 1 of our code did just that. It constantly checked if it was on the blue tape: if it was, it went straight, otherwise, it turned left.\n\n In version 2 of our design, we wanted to try inverting the logic to keep the robot inside the box instead of along the edge. We found this worked better, so we stuck with this design.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-line-follower/images/codev1.jpeg",
          "caption": "Version 1"
        },
        {
          "type": "image",
          "path": "/projects/lego-line-follower/images/codev2.jpeg",
          "caption": "Version 2"
        }
      ]
    }, 
    {
      "heading": "Testing on the track",
      "description": "We started testing on the actual track in the middle of the room. It adapted well to the track after tweaks to the code, but there was an issue where when the robot encountered a corner, the robot didn't turn enough for the sensor to remain inside the track, causing the robot to fall off the track. We tried lowering the speed, which worked but made our robot significantly slower. Instead, we changed the code to make only one wheel turn when turning instead of both wheels and turning the wheels for a preset amount of time to ensure the robot turns enough for the sensor to stay on the track, which worked.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-line-follower/images/code.png",
          "caption": "Code"
        }
      ]
    }, 
    {
      "heading": "Test Run #1 & Revisions",
      "description": "The day of the tournament came and we raced our robot with the other robots in the class, where we completed in 24.39s, getting first place, with 2nd place finishing around 30s and half of the class getting a DNF. \n\nWith our good time, we significantly changed our design to see if the robot would go faster by moving the motors below the brick to make it more compact."
    }, 
    {
      "heading": "Test Run #2 & Revisions",
      "description": "We didn't have enough time to finish the rebuild, which caused us to get a DNF since our robot went off the edge.\n\nWe decided to scrap the previous design since the sensor wasn't aligning well with the ground and detecting the tape properly. We went back to the previous design but added a higher gear ratio (24:16) to give the robot a boost. Like last time, we didn't have enough time to change the timings and speeds in our code, so we didn't get to finish our robot.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-line-follower/images/robot.jpeg",
          "caption": "Final Build"
        }
      ]
    },
    {
      "heading": "Test Run #3",
      "description": "Since we didn't finish our robot, we also got a DNF in this round. We learned that it isn't a good idea to make major changes right before a race. However, our first time trial still made us first out of the entire class, making us the champions.\n\nWe spent some time fixing our build and after some tweaks, we got the robot to work",
      "resources": [
        {
          "type": "video",
          "id": "1Xj_7MujxrAKHw577uDDruvsXtTGRoDXx",
          "caption": "Line Follower Run"
        } 
      ]
    },
    {
      "heading": "Final Thoughts",
      "description": "We are successful in creating a line follower robot that uses color sensors and code to navigate through a course the fastest. We worked together well as a group to build a robot and iterate through many designs to optimize our robot. If I did this again, I’d make a design and stick to it, only changing it well before a race to ensure we have a quality product. I’d also spend more time optimizing the timings and speeds to make the robot finish as fast as possible."
    }
  ]
}

