{
  "title": "Lego Mass Launcher",
  "creators": ["Aarush Maddula", " Kevin Zarate Nonato", "Daniel Flores Cruz"],
  "date": "August 24, 2024",
  "description": "Our group built a Lego Mass Launcher designed to launch a projectile using only potential energy, as well as determined the initial launch velocity of the projectile by analyzing graphs generated by Vernier Video Analysis.",
  "thumbnail": "/projects/lego-mass-launcher/images/launcher.jpeg",
  "type": "engineering",
  "tags": ["Physics", "Data Analysis", "Collaboration", "Lego"],
  "timeline": [
    {
      "heading": "Brainstorming",
      "description": "Initially, each group member came up with their design and we discussed with each other. Our ideas were similar, revolving around a catapult-like design with a few small differences, so we decided to build a catapult with an arm that pivots around a center beam holding a counterweight on the front to propel the ball forward and the projectile on the other end.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-mass-launcher/images/sketch.jpeg",
          "caption": "Sketch of our design"
        }
      ]
    }, 
    {
      "heading": "Initial Build",
      "description": "We built the first iteration of our launcher based on our brainstorming, however we realized there were a few issues:\n\n1) The counterweight (EV3 brick) was exerting too much stress on the structure, causing the structure to be unstable.\n2) The launcher kept falling off the table anytime we tried to launch it.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-mass-launcher/images/launcher-brick.jpeg",
          "caption": "Catapult with counterweight (EV3 Brick)"
        }
      ]
    }, 
    {
      "heading": "Final Build",
      "description": "To address these problems, we: \n\n1) scrapped the counterweight in favor of using the elastic energy of rubber bands to launch the projectile. \n2) added more Lego to the structure to make it more stable\n3) added a back clip to keep the launcher from falling. \n\nIn the end, we built a working launcher :)",
      "resources": [
         {
          "type": "image",
          "path": "/projects/lego-mass-launcher/images/launcher.jpeg",
          "caption": "Full Launcher with back clip"
        },
        {
          "type": "image",
          "path": "/projects/lego-mass-launcher/images/launcher-bands.jpeg",
          "caption": "Launcher with rubber bands"
        }
      ]
    }, 
    {
      "heading": "Data Analysis",
      "description": "After completing our Launcher, we recorded a video of the ball launching into the air and uploaded it onto Vernier Video Analysis Software to generate the x & y Velocity-Time graphs. Using this information, we found the y-intercepts of the trend lines and used the Pythagorean Theorem to find that the initial velocity of the ball was 4.023m/s.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-mass-launcher/images/graph.png",
          "caption": "X & Y Velocity-Time Graphs"
        }, 
        {
          "type": "video",
          "id": "1pi_l3xvIi6OKpRAvDWIQraMlqY281vTe",
          "caption": "Launcher launching a ball"
        }
      ]
    },
    {
      "heading": "Final Thoughts",
      "description": "Overall, I think this project was a success since we built a functional projectile launcher and found the ball's intitial launch velocity. The things we did well was changing and adapting our build as we encountered problems like structural stablility and successfully compromising on our initial design. Despite that, I think we could've documented our building process more properly since we forgot to take photos of some changes to the build."
    }
  ]
}

