{
  "title": "Lego Sumo Robot",
  "creators": ["Aarush Maddula", "Autumn Ludwig"],
  "date": "October 1, 2024",
  "description": "Our group built a Lego Sumo Robot that successfully defeated numerous robots in a class competition, refining its effectiveness through multiple iterations while conforming to the 12\" x 12\" x 12\" size and 3 motor constraints.",
  "thumbnail": "/projects/lego-sumo-robot/images/robot.jpeg",
  "type": "engineering",
  "tags": ["Physics", "Data Analysis", "Collaboration", "Lego"],
  "timeline": [
    {
      "heading": "Brainstorming",
      "description": "Me and Autumn had different ideas for our robot, with my designs consisting of a robot that \"punches\" the robot off the edge and a robot that scoops the other robot from underneath and flips it, both using a distance sensor to detect if an opponent is in front and activate the system. Autumn's idea was to use a rotating piece on the front to hit the other robots. We worked together and reached a compromise: to use my scoop design, but remove the sensor since we thought it would be more effective if we manually activated the scoop ourselves. We also wanted it to have 2 wheels in the front and a rolling ball in the back so it could maneuver properly, as well as some weight to ensure the robot doesn't flip itself over when flipping the opponent.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/sketch.jpeg",
          "caption": "Final Sketch"
        },
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/mysketch.jpeg",
          "caption": "My sketches"
        },
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/autumnsketch.jpeg",
          "caption": "Autumn's Sketch"
        }        
      ]
    }, 
    {
      "heading": "Initial Design",
      "description": "We built our initial design, composed of the 3 wheeled design, a scoop, and an EV3 for weight, however, we realized there were a few issues during testing.\n\n1) When our robot tried to pick something up, the car body would flip since it wasn't heavy enough.\n2) The wheels kept slipping, reducing the overall traction.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/wheels.jpeg",
          "caption": "Initial Sumo Robot Build"
        }
      ]
    }, 
    {
      "heading": "Revised Design",
      "description": "To fix these issues, we:\n\n1) Replaced the wheels for a track design for increased traction.\n2) Added another Ev3 brick on the top to increase the weight and traction of the robot. \n3) Increased the scoop size and distance from the ground to increase the efficiency of the robot.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/tracks.jpeg",
          "caption": "Revised Sumo Robot Build"
        }
      ]
    }, 
    {
      "heading": "Competition #1",
      "description": "We competed with other robots our class made in the first competition, placing 3rd / 6th. However, we encountered many issues during the competition.\n\n1) During one round, both tracks came off the sumo robot since they weren’t properly secured, rendering the robot unmoveable.\n2) Our controller was often glitchy and slow to respond to input, causing the robot to unexpectedly move backwards and fall off the table.\n3) The treads were too loose, slowing us down and allowing the opponent to rip off our tracks.",
      "resources": [
        {
          "type": "video",
          "id": "1OpPTVhrcyOiA7uMEqHq4-xZnF9ZoM0AL",
          "caption": "Video of one of our rounds"
        } 
      ]
    }, 
    {
      "heading": "Redesign Process",
      "description": "To fix these issues, we:\n\n1) Improved the track assembly by adding more connections with the body so it doesn't disconnect and making the assembly longer so the track can fit snuggly with the assembly.\n2) Added spikes to our scoop to make it easier for the scoop to go under opponent robots.\n3) Switched the joystick to a D-pad since when we used the joystick, angling it to a diagonal would glitch between one of the adjacent axes.",
      "resources": [
        {
          "type": "image",
          "path": "/projects/lego-sumo-robot/images/robot.jpeg",
          "caption": "Final Sumo Robot Build"
        }
      ]
    }, 
    {
      "heading": "Competition #2",
      "description": "We competed for a second time where we did worse, placing in 4th / 6th place. We think this is because our opponents' scoops were bigger, sharper, and lower to the ground than ours, with 1 opponent using a 3d printed part to achieve this. This caused our robot to get caught on the scoop and get pushed off the edge easily."
    },
    {
      "heading": "Final Thoughts",
      "description": "I think this project was a success as we created a Lego Sumo Robot that met the requirements of using 3 motors and fitting in a 12 in by 12 in box. If we did this again, I think we could’ve 3d printed some parts to create a more effective, lower, and bigger scoop that could’ve helped in defeating our opponent. Otherwise, I am proud of our design process since throughout the design process, Autumn and I successfully collaborated and compromised to create this robot and I had plenty of fun throughout it. I learned more about how to program Lego Mindstorm robots and gained experience with communication and teamwork skills."
    }
  ]
}

